Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::VentilationPortDefault::Modifier Class Reference
MEP Element Manager
Modifier of the VentilationPortDefault. More...
#include <MEPVentilationPortDefault.hpp>
 Inheritance diagram for ACAPI::MEP::VentilationPortDefault::Modifier:
 Public Member Functions
void  | SetHeight (double height)
Sets the height of the VentilationPort.
void  | SetWallThickness (double thickness)
Sets the thickness of the VentilationPort's wall.
void  | SetFlowDirection (FlowDirection flowDirection)
Sets the flow direction of the VentilationPort.
 Public Member Functions inherited from ACAPI::MEP::PortDefaultBase::Modifier
void  | SetWidth (double width)
Sets the width of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions
Modifier (VentilationPortDefault &parent)
Constructs a Modifier with the given VentilationPortDefault parent.
 Protected Member Functions inherited from ACAPI::MEP::PortDefaultBase::Modifier
Modifier (PortDefaultBase &parent)
Constructs a Modifier with the given PortDefaultBase parent.
Detailed Description
Modifier of the VentilationPortDefault.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::VentilationPortDefault::Modifier::Modifier  |  ( |  VentilationPortDefault & |  parent | )
protected
Constructs a Modifier with the given VentilationPortDefault parent.
Parameters
parent | The parent VentilationPortDefault.
Member Function Documentation
◆ SetFlowDirection()
 void ACAPI::MEP::VentilationPortDefault::Modifier::SetFlowDirection  |  ( |  FlowDirection |  flowDirection | )
Sets the flow direction of the VentilationPort.
Parameters
flowDirection | The value to be set.
◆ SetHeight()
 void ACAPI::MEP::VentilationPortDefault::Modifier::SetHeight  |  ( |  double |  height | )
Sets the height of the VentilationPort.
Parameters
height | The value to be set.
◆ SetWallThickness()
 void ACAPI::MEP::VentilationPortDefault::Modifier::SetWallThickness  |  ( |  double |  thickness | )
Sets the thickness of the VentilationPort's wall.
Parameters
thickness | The value to be set.